# Homebrew Bundle file
# Install with: brew bundle

# Taps
tap "koekeishiya/formulae"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "jonaylor89/tap"

# CLI Tools
brew "ansible"
brew "bash-completion"
brew "cmake"
brew "cowsay"
brew "docker-compose"
brew "docker-machine"
brew "fd"
brew "figlet"
brew "fish"
brew "fortune"
brew "fx"
brew "fzf"
brew "gcc"
brew "gdb"
brew "git"
brew "git-lfs"
brew "go"
brew "htop"
brew "hub"
brew "neofetch"
brew "node"
brew "nmap"
brew "openfaas-cli"
brew "openssl"
brew "python"
brew "ranger"
brew "starship"
brew "tailscale"
brew "tmux"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "zsh-syntax-highlighting"

# GUI Applications
cask "blender"
cask "beaker-browser"
cask "docker"
cask "discord"
cask "firefox"
cask "firefox-nightly"
cask "google-chrome"
cask "iterm2"
cask "jetbrains-toolbox"
cask "macvim"
cask "notion"
cask "slack"
cask "spotify"
cask "vscodium"
