# Homebrew Bundle file
# Install with: brew bundle

# Taps
tap "koekeishiya/formulae"
tap "homebrew/bundle"
tap "homebrew/services"
tap "jonaylor89/tap"

# CLI Tools
brew "ansible"
brew "bash-completion"
brew "cmake"
brew "cowsay"
brew "fd"
brew "figlet"
brew "fish"
brew "fortune"
brew "fx"
brew "fzf"
brew "gcc"
brew "git"
brew "git-lfs"
brew "go"
brew "htop"
brew "hub"
brew "neofetch"
brew "fastfetch"
brew "nmap"
brew "openssl"
brew "python"
brew "ranger"
brew "starship"
brew "tailscale"
brew "tmux"
brew "wget"
brew "yarn"
brew "youtube-dl"
brew "zsh"
brew "zsh-syntax-highlighting"

# GUI Applications
cask "docker-desktop"
cask "discord"
cask "firefox"
cask "brave-browser"
cask "google-chrome"
cask "ghostty"
cask "jetbrains-toolbox"
cask "notion"
cask "slack"
cask "spotify"
cask "zed"
